gloomyandy/CoreN2G/src/STM32BTC/AsyncSerial.cpp
//author: Andy
#if USE_UART0 || USE_UART1 || USE_UART2
#include <CoreImp.h>
#include <CoreNotifyIndices.h>
#include "AsyncSerial.h"
extern "C" void debugPrintf(const char* fmt, ...) __attribute__ ((format (printf, 1, 2)));

AsyncSerial::AsyncSerial(const UartParameters& params) noexcept
{
    memset(&this->handle, 0, sizeof(this->handle));
    uart = nullptr;
    prio = 0;
    txWaitingTask = nullptr;
    txEnabled = false;
    onTransmissionEndedFn = nullptr;
}


int8_t AsyncSerial::GetUARTPortNumber() noexcept
{
    return get_port_number();
}

bool AsyncSerial::Configure(Pin rx, Pin tx) noexcept
{
    //Find the UART based on the confgured Pins
    void* rxDev = pinmap_peripheral(rx, PinMap_UART_RX);
    void* txDev = pinmap_peripheral(tx, PinMap_UART_TX);

    if (rxDev != nullptr && (rxDev == txDev))
    {
        pin_rx = rx;
        pin_tx = tx;
        return true;
    }
    return false;    
}

void AsyncSerial::begin(uint32_t baud, UartMode mode) noexcept
{
    uint32_t databits = 0;
    uint32_t stopbits = 0;
    uint32_t parity = 0;

    switch (mode)
    {
    case UartMode::Mode8N1:
    default:
        databits = UART_WORDLENGTH_8B;
        stopbits = UART_STOPBITS_1;
        parity = UART_PARITY_NONE;
        break;

    case UartMode::Mode8E1:
        databits = UART_WORDLENGTH_9B;
        stopbits = UART_STOPBITS_1;
        parity = UART_PARITY_EVEN;
        break;

    case UartMode::Mode8O1:
        databits = UART_WORDLENGTH_9B;
        stopbits = UART_STOPBITS_1;
        parity = UART_PARITY_ODD;
        break;
    }


    init( (uint32_t)baud, databits, parity, stopbits);
    if (uart != nullptr)
    {
        rx_head = 0;
        rx_tail = 0;
        tx_head = 0;
        tx_tail = 0;
        txEnabled = true;
        start_rx();
    }
}

void AsyncSerial::end(void) noexcept
{
    if (uart != nullptr)
    {
        // wait for transmission of outgoing data
        flush();
        deinit();
        // clear any received data
        rx_head = 0;
        rx_tail = 0;
    }
}

int AsyncSerial::read(void) noexcept
{
    if (uart != nullptr)
    {
        // if the head isn't ahead of the tail, we don't have any characters
        if (rx_head == rx_tail) 
        {
            return -1;
        } 
        else 
        {
            unsigned char c = rx_buff[rx_tail];
            rx_tail = (rx_tail + 1) % SERIAL_RX_BUFFER_SIZE;
            return c;
        }
    }

    return -1;
}

int AsyncSerial::peek(void) noexcept
{
    if (uart != nullptr)
    {
        if (rx_head == rx_tail) 
        {
            return -1;
        } 
        else 
        {
            return rx_buff[rx_tail];
        }
    }
    
    return -1;
}

int AsyncSerial::available(void) noexcept
{
    if (uart != nullptr)
    {
        return rx_available();
    }
    return 0;
}

int AsyncSerial::availableForWrite(void) noexcept
{
    if (uart != nullptr)
    {
        return tx_available();
    }
    return 0;
}


size_t AsyncSerial::canWrite() noexcept
{
    if (uart != nullptr)
    {
        return availableForWrite();
    }
    return 0;
}

size_t AsyncSerial::write(const uint8_t c) noexcept
{
    if (uart != nullptr)
    {
        for(;;)
        {
            uint32_t i = (tx_head + 1) % SERIAL_TX_BUFFER_SIZE;
            if (i != tx_tail)
            {
                tx_buff[tx_head] = c;
                tx_head = i;
                if (txEnabled)
                {
                    start_tx();
                }
                break;
            }
            if (!txEnabled)
            {
                return 0;
            }
#ifdef RTOS
            txWaitingTask = RTOSIface::GetCurrentTask();
#endif
            start_tx();
#ifdef RTOS
            TaskBase::TakeIndexed(NotifyIndices::UartTx, 50);
#endif
        }
    }

    return 1;
}


size_t AsyncSerial::writeBlock(const uint8_t *buffer, size_t size) noexcept
{
    uint32_t head = tx_head;
    uint32_t tail = tx_tail;
    size_t toCopy = (SERIAL_TX_BUFFER_SIZE - 1 - head + tail) % SERIAL_TX_BUFFER_SIZE;

    if (toCopy > size) toCopy = size;
    if (toCopy > 0)
    {
        size_t toCopyNext;
        if (head >= tail)
        {
            size_t toCopyFirst = SERIAL_TX_BUFFER_SIZE - head;
            if (toCopy < toCopyFirst)
            {
                memcpy(&(tx_buff[head]), buffer, toCopy);
                tx_head = head + toCopy;
                return toCopy;
            }
            memcpy(&(tx_buff[head]), buffer, toCopyFirst);
            head = 0;
            toCopyNext = toCopy - toCopyFirst;
            buffer += toCopyFirst;
        }
        else
            toCopyNext = toCopy;
        memcpy(&(tx_buff[head]), buffer, toCopyNext);
        tx_head = head + toCopyNext;
    }
    return toCopy;
}

size_t AsyncSerial::write(const uint8_t *buffer, size_t size) noexcept
{
    if (uart != nullptr)
    {
        size_t ret = 0;
        for(;;)
        {
            size_t len = writeBlock(buffer, size);
            size -= len;
            buffer += len;
            ret += len;
            if (!txEnabled)
            {
                break;
            }
            if (size == 0)
            {
                start_tx();
                break;
            }
#ifdef RTOS
            txWaitingTask = RTOSIface::GetCurrentTask();
#endif
            start_tx();
#ifdef RTOS
            TaskBase::TakeIndexed(NotifyIndices::UartTx, 50);
#endif
        }
        return ret;
    }

    return size;
}

void AsyncSerial::flush(void) noexcept
{
    if (uart != nullptr)
    {
        // wait for the buffer to empty
        while ((tx_head != tx_tail)) 
        {
            // nop, the interrupt handler will free up space for us
        }
        // and for the hardware to complete sending
#if STM32H7
        while((READ_REG(handle.Instance->ISR) & UART_FLAG_TXE) == 0) {}
#else
        while((READ_REG(handle.Instance->SR) & UART_FLAG_TXE) == 0) {}
#endif
   }
}


void AsyncSerial::setInterruptPriority(uint32_t priority) noexcept
{
    prio = priority;
    if (uart != nullptr)
    {
        set_interrupt_priority( priority);
    }
}

