gloomyandy/CoreN2G/src/STM32BTC/AsyncSerial.cpp
uint32_t AsyncSerial::getInterruptPriority() noexcept
{
    return prio;
}

bool AsyncSerial::IsConnected() noexcept
{
    if (uart != nullptr) return true;
    return false;
}


// FIXME we should probbaly implement the call back for this!
AsyncSerial::InterruptCallbackFn AsyncSerial::SetInterruptCallback(InterruptCallbackFn f) noexcept
{
    AtomicCriticalSectionLocker lock;
    InterruptCallbackFn ret = interruptCallback;
    interruptCallback = f;
    return ret;
}

AsyncSerial::OnTransmissionEndedFn AsyncSerial::SetOnTxEndedCallback(OnTransmissionEndedFn f, CallbackParameter cp) noexcept
{
    AtomicCriticalSectionLocker lock;
    const OnTransmissionEndedFn ret = onTransmissionEndedFn;
    onTransmissionEndedFn = f;
    onTransmissionEndedCp = cp;
    return ret;
}

void AsyncSerial::ClearTransmitBuffer() noexcept
{
    if (uart != nullptr)
    {
        AtomicCriticalSectionLocker lock;
        tx_tail = tx_head;
    }
    flush();
}

void AsyncSerial::ClearReceiveBuffer() noexcept
{
    AtomicCriticalSectionLocker lock;
    rx_tail = rx_head;
}

void AsyncSerial::DisableTransmit() noexcept
{
    flush();
    txEnabled = false;
}

void AsyncSerial::EnableTransmit() noexcept
{
    txEnabled = true;
    start_tx();
}


// Get and clear the errors
AsyncSerial::Errors AsyncSerial::GetAndClearErrors() noexcept
{
    Errors errs;
    if  (uart != nullptr)
    {
        errs.bufferOverrun = rx_full;
        errs.framing = hw_error;
        errs.uartOverrun = rx_overrun;
        hw_error = rx_full = rx_overrun = 0;
    }
    else
    {
        errs.bufferOverrun = 0;
        errs.framing = 0;
        errs.uartOverrun = 0;
    }
	return errs;
}


// low level implementation
typedef enum {
#if defined(USART1_BASE)
    UART1_INDEX,
#endif
#if defined(USART2_BASE)
    UART2_INDEX,
#endif
#if defined(USART3_BASE)
    UART3_INDEX,
#endif
#if defined(UART4_BASE) || defined(USART4_BASE)
    UART4_INDEX,
#endif
#if defined(UART5_BASE) || defined(USART5_BASE)
    UART5_INDEX,
#endif
#if defined(USART6_BASE)
    UART6_INDEX,
#endif
#if defined(UART7_BASE) || defined(USART7_BASE)
    UART7_INDEX,
#endif
#if defined(UART8_BASE) || defined(USART8_BASE)
    UART8_INDEX,
#endif
#if defined(UART9_BASE)
    UART9_INDEX,
#endif
#if defined(UART10_BASE)
    UART10_INDEX,
#endif
#if defined(LPUART1_BASE)
    LPUART1_INDEX,
#endif
    UART_NUM
} index_t;

static AsyncSerial *handlers[UART_NUM] = {nullptr};

void AsyncSerial::init(uint32_t baudrate, uint32_t databits, uint32_t parity, uint32_t stopbits) noexcept
{
    UART_HandleTypeDef *huart = &(handle);
    uint8_t index = 0;
    /* Determine the U(S)ART peripheral to use (USART1, USART2, ...) */
    void *tx = pinmap_peripheral(pin_tx, PinMap_UART_TX);
    void *rx = pinmap_peripheral(pin_rx, PinMap_UART_RX);

    /* Pins Rx/Tx must not be NP */
    if (rx == NP || tx == NP) {
        debugPrintf("ERROR: at least one UART pin has no peripheral\n");
        return;
    }
    hw_error = rx_full = rx_overrun = 0;
 
    /*
     * Get the peripheral name (USART1, USART2, ...) from the pin
     * and assign it to the ect
     */
    uart = (USART_TypeDef *)pinmap_merge_peripheral(tx, rx);

    if (uart == NP) {
        debugPrintf("ERROR: U(S)ART pins mismatch\n");
        return;
    }

    /* Enable USART clock */
#if defined(USART1_BASE)
    else if (uart == USART1) {
        __HAL_RCC_USART1_FORCE_RESET();
        __HAL_RCC_USART1_RELEASE_RESET();
        __HAL_RCC_USART1_CLK_ENABLE();
        index = UART1_INDEX;
        irq = USART1_IRQn;
    }
#endif
#if defined(USART2_BASE)
    else if (uart == USART2) {
        __HAL_RCC_USART2_FORCE_RESET();
        __HAL_RCC_USART2_RELEASE_RESET();
        __HAL_RCC_USART2_CLK_ENABLE();
        index = UART2_INDEX;
        irq = USART2_IRQn;
    }
#endif
#if defined(USART3_BASE)
    else if (uart == USART3) {
        __HAL_RCC_USART3_FORCE_RESET();
        __HAL_RCC_USART3_RELEASE_RESET();
        __HAL_RCC_USART3_CLK_ENABLE();
        index = UART3_INDEX;
        irq = USART3_IRQn;
    }
#endif
#if defined(UART4_BASE)
    else if (uart == UART4) {
        __HAL_RCC_UART4_FORCE_RESET();
        __HAL_RCC_UART4_RELEASE_RESET();
        __HAL_RCC_UART4_CLK_ENABLE();
        index = UART4_INDEX;
        irq = UART4_IRQn;
    }
#elif defined(USART4_BASE)
    else if (uart == USART4) {
        __HAL_RCC_USART4_FORCE_RESET();
        __HAL_RCC_USART4_RELEASE_RESET();
        __HAL_RCC_USART4_CLK_ENABLE();
        index = UART4_INDEX;
        irq = USART4_IRQn;
    }
#endif
#if defined(UART5_BASE)
    else if (uart == UART5) {
        __HAL_RCC_UART5_FORCE_RESET();
        __HAL_RCC_UART5_RELEASE_RESET();
        __HAL_RCC_UART5_CLK_ENABLE();
        index = UART5_INDEX;
        irq = UART5_IRQn;
    }
#elif defined(USART5_BASE)
    else if (uart == USART5) {
        __HAL_RCC_USART5_FORCE_RESET();
        __HAL_RCC_USART5_RELEASE_RESET();
        __HAL_RCC_USART5_CLK_ENABLE();
        index = UART5_INDEX;
        irq = USART5_IRQn;
    }
#endif
#if defined(USART6_BASE)
    else if (uart == USART6) {
        __HAL_RCC_USART6_FORCE_RESET();
        __HAL_RCC_USART6_RELEASE_RESET();
        __HAL_RCC_USART6_CLK_ENABLE();
        index = UART6_INDEX;
        irq = USART6_IRQn;
    }
#endif
#if defined(LPUART1_BASE)
    else if (uart == LPUART1) {
        __HAL_RCC_LPUART1_FORCE_RESET();
        __HAL_RCC_LPUART1_RELEASE_RESET();
        __HAL_RCC_LPUART1_CLK_ENABLE();
        index = LPUART1_INDEX;
        irq = LPUART1_IRQn;
    }
#endif
#if defined(UART7_BASE)
    else if (uart == UART7) {
        __HAL_RCC_UART7_FORCE_RESET();
        __HAL_RCC_UART7_RELEASE_RESET();
        __HAL_RCC_UART7_CLK_ENABLE();
        index = UART7_INDEX;
        irq = UART7_IRQn;
    }
#elif defined(USART7_BASE)
    else if (uart == USART7) {
        __HAL_RCC_USART7_FORCE_RESET();
        __HAL_RCC_USART7_RELEASE_RESET();
        __HAL_RCC_USART7_CLK_ENABLE();
        index = UART7_INDEX;
        irq = USART7_IRQn;
    }
#endif
#if defined(UART8_BASE)
    else if (uart == UART8) {
        __HAL_RCC_UART8_FORCE_RESET();
        __HAL_RCC_UART8_RELEASE_RESET();
        __HAL_RCC_UART8_CLK_ENABLE();
        index = UART8_INDEX;
        irq = UART8_IRQn;
    }
#elif defined(USART8_BASE)
    else if (uart == USART8) {
        __HAL_RCC_USART8_FORCE_RESET();
        __HAL_RCC_USART8_RELEASE_RESET();
        __HAL_RCC_USART8_CLK_ENABLE();
        index = UART8_INDEX;
        irq = USART8_IRQn;
    }
#endif
#if defined(UART9_BASE)
    else if (uart == UART9) {
        __HAL_RCC_UART9_FORCE_RESET();
        __HAL_RCC_UART9_RELEASE_RESET();
        __HAL_RCC_UART9_CLK_ENABLE();
        index = UART9_INDEX;
        irq = UART9_IRQn;
    }
#endif
#if defined(UART10_BASE)
    else if (uart == UART10) {
        __HAL_RCC_UART10_FORCE_RESET();
        __HAL_RCC_UART10_RELEASE_RESET();
        __HAL_RCC_UART10_CLK_ENABLE();
        index = UART10_INDEX;
        irq = UART10_IRQn;
    }
#endif
    else
    {
        debugPrintf("UART not found\n");
        uart = nullptr;
        return;
    }
#if defined(STM32F091xC) || defined (STM32F098xx)
    /* Enable SYSCFG Clock */
    /* Required to get SYSCFG interrupt status register */
    __HAL_RCC_SYSCFG_CLK_ENABLE();
#endif

    /* Configure UART GPIO pins */
    pinmap_pinout(pin_tx, PinMap_UART_TX);
    pinmap_pinout(pin_rx, PinMap_UART_RX);

    /* Configure uart */
    handlers[index] = this;
    handle.Instance = (USART_TypeDef *)(uart);
    handle.Init.BaudRate = baudrate;
    handle.Init.WordLength = databits;
    handle.Init.StopBits = stopbits;
    handle.Init.Parity = parity;
    handle.Init.Mode = UART_MODE_TX_RX;
    handle.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    handle.Init.OverSampling = UART_OVERSAMPLING_16;
#if (defined(STM32H7xx))
    handle.FifoMode = USART_FIFOMODE_DISABLE;
#endif
#if !defined(STM32F1xx) && !defined(STM32F2xx) && !defined(STM32F4xx)\
 && !defined(STM32L1xx)
    handle.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;
#endif
#ifdef UART_ONE_BIT_SAMPLE_DISABLE
    handle.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
#endif


    if (HAL_UART_Init(huart) != HAL_OK) {
        return;
    }
    if (prio != 0)
    {
        set_interrupt_priority(prio);
    }
    HAL_NVIC_EnableIRQ(irq);
}

void AsyncSerial::deinit() noexcept
{
    /* Reset UART and disable clock */
    HAL_NVIC_DisableIRQ(irq);
#if defined(USART1_BASE)
    if (uart == USART1) {
        __HAL_RCC_USART1_FORCE_RESET();
        __HAL_RCC_USART1_RELEASE_RESET();
        __HAL_RCC_USART1_CLK_DISABLE();
    }
#endif
#if defined(USART2_BASE)
    else if (uart == USART2) {
        __HAL_RCC_USART2_FORCE_RESET();
        __HAL_RCC_USART2_RELEASE_RESET();
        __HAL_RCC_USART2_CLK_DISABLE();
    }
#endif
#if defined(USART3_BASE)
    else if (uart == USART3) {
        __HAL_RCC_USART3_FORCE_RESET();
        __HAL_RCC_USART3_RELEASE_RESET();
        __HAL_RCC_USART3_CLK_DISABLE();
    }
#endif
#if defined(UART4_BASE)
    else if (uart == UART4) {
        __HAL_RCC_UART4_FORCE_RESET();
        __HAL_RCC_UART4_RELEASE_RESET();
        __HAL_RCC_UART4_CLK_DISABLE();
    }
#elif defined(USART4_BASE)
    else if (uart == USART4) {
        __HAL_RCC_USART4_FORCE_RESET();
        __HAL_RCC_USART4_RELEASE_RESET();
        __HAL_RCC_USART4_CLK_DISABLE();
    }
#endif
#if defined(UART5_BASE)
    else if (uart == UART5) {
        __HAL_RCC_UART5_FORCE_RESET();
        __HAL_RCC_UART5_RELEASE_RESET();
        __HAL_RCC_UART5_CLK_DISABLE();
    }
#elif defined(USART5_BASE)
    else if (uart == USART5) {
        __HAL_RCC_USART5_FORCE_RESET();
        __HAL_RCC_USART5_RELEASE_RESET();
        __HAL_RCC_USART5_CLK_DISABLE();
    }
#endif
#if defined(USART6_BASE)
    else if (uart == USART6) {
        __HAL_RCC_USART6_FORCE_RESET();
        __HAL_RCC_USART6_RELEASE_RESET();
        __HAL_RCC_USART6_CLK_DISABLE();
    }
#endif
#if defined(LPUART1_BASE)
    else if (uart == LPUART1) {
        __HAL_RCC_LPUART1_FORCE_RESET();
        __HAL_RCC_LPUART1_RELEASE_RESET();
        __HAL_RCC_LPUART1_CLK_DISABLE();
    }
#endif
#if defined(UART7_BASE)
    else if (uart == UART7) {
        __HAL_RCC_UART7_FORCE_RESET();
        __HAL_RCC_UART7_RELEASE_RESET();
        __HAL_RCC_UART7_CLK_DISABLE();
    }
#elif defined(USART7_BASE)
    else if (uart == USART7) {
        __HAL_RCC_USART7_FORCE_RESET();
        __HAL_RCC_USART7_RELEASE_RESET();
        __HAL_RCC_USART7_CLK_DISABLE();
    }
#endif
#if defined(UART8_BASE)
    else if (uart == UART8) {
        __HAL_RCC_UART8_FORCE_RESET();
        __HAL_RCC_UART8_RELEASE_RESET();
        __HAL_RCC_UART8_CLK_DISABLE();
    }
#elif defined(USART8_BASE)
    else if (uart == USART8) {
        __HAL_RCC_USART8_FORCE_RESET();
        __HAL_RCC_USART8_RELEASE_RESET();
        __HAL_RCC_USART8_CLK_DISABLE();
    }
#endif
#if defined(UART9_BASE)
    else if (uart == UART9) {
        __HAL_RCC_UART9_FORCE_RESET();
        __HAL_RCC_UART9_RELEASE_RESET();
        __HAL_RCC_UART9_CLK_DISABLE();
    }
#endif
#if defined(UART10_BASE)
    else if (uart == UART10) {
        __HAL_RCC_UART10_FORCE_RESET();
        __HAL_RCC_UART10_RELEASE_RESET();
        __HAL_RCC_UART10_CLK_DISABLE();
    }
#endif
    HAL_UART_DeInit(&handle);

