gloomyandy/CoreN2G/src/STM32BTC/AsyncSerial.cpp
}

int8_t AsyncSerial::get_port_number() noexcept
{
#if defined(USART1_BASE)
    if (uart == USART1) {
        return 1;
    }
#endif
#if defined(USART2_BASE)
    else if (uart == USART2) {
        return 2;
 }
#endif
#if defined(USART3_BASE)
    else if (uart == USART3) {
        return 3;
    }
#endif
#if defined(UART4_BASE)
    else if (uart == UART4) {
        return 4;
    }
#elif defined(USART4_BASE)
    else if (uart == USART4) {
        return 4;
    }
#endif
#if defined(UART5_BASE)
    else if (uart == UART5) {
        return 5;
    }
#elif defined(USART5_BASE)
    else if (uart == USART5) {
        return 5;
    }
#endif
#if defined(USART6_BASE)
    else if (uart == USART6) {
        return 6;
    }
#endif
#if defined(LPUART1_BASE)
    else if (uart == LPUART1) {
        return 1;
    }
#endif
#if defined(UART7_BASE)
    else if (uart == UART7) {
        return 7;
    }
#elif defined(USART7_BASE)
    else if (uart == USART7) {
        return 7;
    }
#endif
#if defined(UART8_BASE)
    else if (uart == UART8) {
        return 8;
    }
#elif defined(USART8_BASE)
    else if (uart == USART8) {
        return 8;
    }
#endif
#if defined(UART9_BASE)
    else if (uart == UART9) {
        return 9;
    }
#endif
#if defined(UART10_BASE)
    else if (uart == UART10) {
        return 10;
    }
#endif
    return -1;
}

void AsyncSerial::start_rx() noexcept
{
    __HAL_UART_ENABLE_IT(&handle, UART_IT_RXNE);
    __HAL_UART_ENABLE_IT(&handle, UART_IT_ERR);    
}

void AsyncSerial::start_tx() noexcept
{
    __HAL_UART_ENABLE_IT(&handle, UART_IT_TXE);
}

void AsyncSerial::set_interrupt_priority( uint32_t priority) noexcept
{
    HAL_NVIC_SetPriority(irq, priority, 0);
}


uint32_t AsyncSerial::rx_available() noexcept
{
    return ((uint32_t)(rx_head - rx_tail)) % SERIAL_RX_BUFFER_SIZE;
}

uint32_t AsyncSerial::tx_available() noexcept
{
    return ((uint32_t)(tx_tail + SERIAL_TX_BUFFER_SIZE - 1 - tx_head)) % SERIAL_TX_BUFFER_SIZE;
}

inline HAL_StatusTypeDef AsyncSerial::UART_Receive_IT() noexcept
{
#if STM32H7
    uint8_t val = (uint8_t)(handle.Instance->RDR & (uint8_t)0x00FF);
#else
    uint8_t val = (uint8_t)(handle.Instance->DR & (uint8_t)0x00FF);
#endif
    uint32_t pos = (rx_head + 1) % SERIAL_RX_BUFFER_SIZE;
    if (pos != rx_tail)
    {
        rx_buff[rx_head] = val;
        rx_head = pos;
    }
    else
        rx_full++;
    return HAL_OK;
}

inline HAL_StatusTypeDef AsyncSerial::UART_Transmit_IT(uint32_t isrflags) noexcept
{
    if (tx_tail != tx_head)
    {
        // We have data to send
#if STM32H7
        handle.Instance->TDR = tx_buff[tx_tail];
#else
        handle.Instance->DR = tx_buff[tx_tail];
#endif
        // update write pointer
        tx_tail = (tx_tail + 1) % SERIAL_TX_BUFFER_SIZE;
#if RTOS
        if (txWaitingTask != nullptr && tx_available() >= SERIAL_TX_BUFFER_SIZE/2)
        {
            TaskBase::GiveFromISR(txWaitingTask, NotifyIndices::UartTx);
            txWaitingTask = nullptr;
        }
#endif
    }
    else
    {
        // no data left
        /* Disable the UART Transmit empty Interrupt */
        __HAL_UART_DISABLE_IT(&handle, UART_IT_TXE);
        if (onTransmissionEndedFn != nullptr)					// if we want callback when the transmitter is empty
        {
            if ((isrflags & UART_FLAG_TC) != RESET)
            {
                /* Disable the UART Transmit Complete Interrupt */
                __HAL_UART_DISABLE_IT(&handle, UART_IT_TC);
                onTransmissionEndedFn(onTransmissionEndedCp);	// execute the callback
            }
            else
            {
                /* Enable the UART Transmit Complete Interrupt */
                __HAL_UART_ENABLE_IT(&handle, UART_IT_TC);
            }
        }
#if RTOS
        if (txWaitingTask != nullptr)
        {
            TaskBase::GiveFromISR(txWaitingTask, NotifyIndices::UartTx);
            txWaitingTask = nullptr;
        }
#endif
    }
    return HAL_OK;
}

void AsyncSerial::UART_IRQHandler() noexcept
{
#if STM32H7
    uint32_t isrflags = READ_REG(handle.Instance->ISR);
    uint32_t errorflags = (isrflags & (uint32_t)(USART_ISR_PE | USART_ISR_FE | USART_ISR_ORE | USART_ISR_NE | USART_ISR_RTOF));
#else
    uint32_t isrflags = READ_REG(handle.Instance->SR);
    uint32_t errorflags = (isrflags & (uint32_t)(UART_FLAG_PE | UART_FLAG_FE | UART_FLAG_ORE | UART_FLAG_NE));
#endif

    if ((isrflags & UART_FLAG_RXNE) != RESET)
    {
        UART_Receive_IT();
    }

    /* If some errors occur */
// FIXME: This is a mess different flags on H7/F4
#if STM32H7
    if (errorflags != RESET)
    {
        /* UART parity error interrupt occurred -------------------------------------*/
        if ((isrflags & USART_ISR_PE) != 0U)
        {
            __HAL_UART_CLEAR_FLAG(&handle, UART_CLEAR_PEF);
        }

        /* UART frame error interrupt occurred --------------------------------------*/
        if ((isrflags & USART_ISR_FE) != 0U)
        {
            __HAL_UART_CLEAR_FLAG(&handle, UART_CLEAR_FEF);
            hw_error++;
         }

        /* UART noise error interrupt occurred --------------------------------------*/
        if ((isrflags & USART_ISR_NE) != 0U)
        {
            __HAL_UART_CLEAR_FLAG(&handle, UART_CLEAR_NEF);
            hw_error++;
         }

        /* UART Over-Run interrupt occurred -----------------------------------------*/
        if ((isrflags & USART_ISR_ORE) != 0U)
        {
            __HAL_UART_CLEAR_FLAG(&handle, UART_CLEAR_OREF);
            rx_overrun++;
        }

        /* UART Receiver Timeout interrupt occurred ---------------------------------*/
        if ((isrflags & USART_ISR_RTOF) != 0U)
        {
            __HAL_UART_CLEAR_FLAG(&handle, UART_CLEAR_RTOF);
        }
    }
#else
    /* If some errors occur */
    if (errorflags != RESET)
    {
        /* UART parity error interrupt occurred ----------------------------------*/
        if ((isrflags & USART_SR_PE) != RESET)
        {
            __HAL_UART_CLEAR_PEFLAG(&handle);
        }

        /* UART noise error interrupt occurred -----------------------------------*/
        if ((isrflags & USART_SR_NE) != RESET)
        {
            __HAL_UART_CLEAR_NEFLAG(&handle);
            hw_error++;
        }

