gloomyandy/CoreN2G/src/STM32BTC/AsyncSerial.cpp
        /* UART frame error interrupt occurred -----------------------------------*/
        if ((isrflags & USART_SR_FE) != RESET)
        {
            __HAL_UART_CLEAR_FEFLAG(&handle);
            hw_error++;
         }

        /* UART Over-Run interrupt occurred --------------------------------------*/
        if ((isrflags & USART_SR_ORE) != RESET)
        {
            __HAL_UART_CLEAR_OREFLAG(&handle);
            rx_overrun++;
        }
    } /* End if some error occurs */
#endif
    /* UART in mode Transmitter ------------------------------------------------*/
    if (((isrflags & UART_FLAG_TXE) != RESET) && txEnabled)
    {
        UART_Transmit_IT(isrflags);
        return;
    }
}

extern "C" {
#if defined(USART1_BASE)
void USART1_IRQHandler(void)
{
    HAL_NVIC_ClearPendingIRQ(USART1_IRQn);
    handlers[UART1_INDEX]->UART_IRQHandler();
}
#endif

#if defined(USART2_BASE)
void USART2_IRQHandler(void)
{
    HAL_NVIC_ClearPendingIRQ(USART2_IRQn);
    handlers[UART2_INDEX]->UART_IRQHandler();
}
#endif

#if defined(USART3_BASE)
void USART3_IRQHandler(void)
{
    HAL_NVIC_ClearPendingIRQ(USART3_IRQn);
#if defined(STM32F091xC) || defined (STM32F098xx)
    if (__HAL_GET_PENDING_IT(HAL_ITLINE_USART3) != RESET) {
        handlers[UART3_INDEX]->UART_IRQHandler();
    }
    if (__HAL_GET_PENDING_IT(HAL_ITLINE_USART4) != RESET) {
        handlers[UART4_INDEX]->UART_IRQHandler();
    }
    if (__HAL_GET_PENDING_IT(HAL_ITLINE_USART5) != RESET) {
        handlers[UART5_INDEX]->UART_IRQHandler();
    }
    if (__HAL_GET_PENDING_IT(HAL_ITLINE_USART6) != RESET) {
        handlers[UART6_INDEX]->UART_IRQHandler();
    }
    if (__HAL_GET_PENDING_IT(HAL_ITLINE_USART7) != RESET) {
        handlers[UART7_INDEX]->UART_IRQHandler();
    }
    if (__HAL_GET_PENDING_IT(HAL_ITLINE_USART8) != RESET) {
        handlers[UART8_INDEX]->UART_IRQHandler();
    }
#else
    if (handlers[UART3_INDEX] != NULL) {
        handlers[UART3_INDEX]->UART_IRQHandler();
    }
#if defined(STM32F0xx)
    /* USART3_4_IRQn */
    if (handlers[UART4_INDEX] != NULL) {
        handlers[UART4_INDEX]->UART_IRQHandler();
    }
#if defined(STM32F030xC)
    if (handlers[UART5_INDEX] != NULL) {
        handlers[UART5_INDEX]->UART_IRQHandler();
    }
    if (handlers[UART6_INDEX] != NULL) {
        handlers[UART6_INDEX]->UART_IRQHandler();
    }
#endif /* STM32F030xC */
#endif /* STM32F0xx */
#endif /* STM32F091xC || STM32F098xx */
}
#endif

#if defined(UART4_BASE)
void UART4_IRQHandler(void)
{
    HAL_NVIC_ClearPendingIRQ(UART4_IRQn);
    handlers[UART4_INDEX]->UART_IRQHandler();
}
#endif

#if defined(STM32L0xx)
#if defined(USART4_BASE) || defined(USART5_BASE)
void USART4_5_IRQHandler(void)
{
    HAL_NVIC_ClearPendingIRQ(USART4_IRQn);
    if (handlers[UART4_INDEX] != NULL) {
        handlers[UART4_INDEX]->UART_IRQHandler();
    }
    if (handlers[UART5_INDEX] != NULL) {
        handlers[UART5_INDEX]->UART_IRQHandler();
    }
}
#endif
#endif

#if defined(UART5_BASE)
void UART5_IRQHandler(void)
{
    HAL_NVIC_ClearPendingIRQ(UART5_IRQn);
    handlers[UART5_INDEX]->UART_IRQHandler();
}
#endif

#if defined(USART6_BASE) && !defined(STM32F0xx)
void USART6_IRQHandler(void)
{
    HAL_NVIC_ClearPendingIRQ(USART6_IRQn);
    handlers[UART6_INDEX]->UART_IRQHandler();
}
#endif

#if defined(LPUART1_BASE)
void LPUART1_IRQHandler(void)
{
    HAL_NVIC_ClearPendingIRQ(LPUART1_IRQn);
    handlers[LPUART1_INDEX]->UART_IRQHandler();
}
#endif

#if defined(UART7_BASE)
void UART7_IRQHandler(void)
{
    HAL_NVIC_ClearPendingIRQ(UART7_IRQn);
    handlers[UART7_INDEX]->UART_IRQHandler();
}
#endif

#if defined(UART8_BASE)
void UART8_IRQHandler(void)
{
    HAL_NVIC_ClearPendingIRQ(UART8_IRQn);
    handlers[UART8_INDEX]->UART_IRQHandler();
}
#endif

#if defined(UART9_BASE)
void UART9_IRQHandler(void)
{
    HAL_NVIC_ClearPendingIRQ(UART9_IRQn);
    handlers[UART9_INDEX]->UART_IRQHandler();
}
#endif

#if defined(UART10_BASE)
void UART10_IRQHandler(void)
{
    HAL_NVIC_ClearPendingIRQ(UART10_IRQn);
    handlers[UART10_INDEX]->UART_IRQHandler();
}
#endif
}
#endif
